crates/irontraffic-bench/tests/fixtures/h2load-output.txt

finished in 35.00s, 2857.14 req/s, 340.14KB/s
requests: 100000 total, 100000 started, 100000 done, 99980 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 99980 2xx, 0 3xx, 0 4xx, 20 5xx
traffic: 11.35MB (11905000) total, 285.16KB (292000) headers (space savings 12.34%), 10.49MB (11000000) data
                     min         max         mean         sd        +/- sd
time for request:  239us  11.85ms  602us  351us  89.35%
time for connect:  120us   980us   310us   95us   91.20%
time to 1st byte:  180us  9.40ms  450us  210us  88.10%
req/s           :   2800.00   2900.00   2857.14   25.30   90.00%